---
kind: method
id: M:Autodesk.Revit.DB.CameraInfo.Dispose
source: html/35021daa-334f-3fb2-d707-7f377d97808e.htm
---
# Autodesk.Revit.DB.CameraInfo.Dispose Method

Releases all resources used by the CameraInfo

## Syntax (C#)
```csharp
public void Dispose()
```